<?php 

//$a=20;
//$b=$a>>1;
//var_dump($b);



/*
|-----------------------------------------------------------------------------------------------------------------------
| 求最大公约数
|-----------------------------------------------------------------------------------------------------------------------
|
| 使用算法：欧几里得算法，《九章算术》更相减损法
|
*/


/*
 * 方法一
 *
 * 欧几里得算法 辗转相除法
 *
 * 原理：两个正整数a和b（a>b），它们的最大公约数等于a除以b的余数c和b之间的最大公约数
 *
 * 例：10和25,25除以10余5，那么10和25的最大公约数，等同于10和5的最大公约数
 *
 */

//class getGcd {
//	public function gggggg ($aa,$bb){
//        if($aa>$bb){
//            $result = $this->gcd($aa,$bb);
//        }else{
//            $result = $this->gcd($bb,$aa);
//        }
//        return $result;
//	}
//	public function gcd($a,$b){
//		if($a%$b==0){
//			return $b;
//		}else{
//			$bbbb=$this->gcd($b,$a%$b);
//			return $bbbb;
//		}
//	}
//}
//
//$abc=new getGcd();
//
//$bbb=$abc->gggggg(12000,888);
//
//var_dump($bbb);

/*
 * 分析：当两个整数较大时，取模运算的性能会比较低
 *
 */


//----------------------------------------------------------------------------------------------------------------------

/*
 * 方法二
 *
 * 《九章算术》更相减损术
 *
 * 原理：两个正整数a和b（a>b），它们的最大公约数等于a-b的差值c和较小数b的最大公约数
 *
 * 例：10和25,25减去10的差值是15，那么10和25的最大公约数，等同于10和15的最大公约数
 *
 */
//class getGcd{
//    public function gcd($a,$b){
//        if($a==$b){
//            return $a;
//        }
//        if($a>$b){
//            return $this->gcd($a-$b,$b);
//        }else{
//            return $this->gcd($b-$a,$a);
//        }
//    }
//}
//
//$abc=new getGcd();
//$bbb=$abc->gcd(1000002,311112);
//var_dump($bbb);

/*
 * 分析：依靠两数求差的方式来递归，运算次数远大于辗转相除法的取模方式
 */


//----------------------------------------------------------------------------------------------------------------------

/*
 * 方法三
 *
 * 辗转相除法与更相减损术结合
 *
 * 原理：把两个方法的优势结合起来，在更相减损术的基础上使用移位运算
 *
 */










/*
 * 原创：伯乐在线 - 玻璃猫 链接：http://blog.jobbole.com/106315/
 */