<?php

/*
|-----------------------------------------------------------------------------------------------------------------------
| 求最大公约数
|-----------------------------------------------------------------------------------------------------------------------
|
| 使用算法：欧几里得算法，《九章算术》更相减损术
|
*/


/*
 * 方法一
 *
 * 欧几里得算法 辗转相除法
 *
 * 原理：两个正整数a和b（a>b），它们的最大公约数等于a除以b的余数c和b之间的最大公约数
 *
 * 例：10和25,25除以10余5，那么10和25的最大公约数，等同于10和5的最大公约数
 *
 */

//class getGcd {
//	public function gggggg ($aa,$bb){
//        if($aa>$bb){
//            $result = $this->gcd($aa,$bb);
//        }else{
//            $result = $this->gcd($bb,$aa);
//        }
//        return $result;
//	}
//	public function gcd($a,$b){
//		if($a%$b==0){
//			return $b;
//		}else{
//			$bbbb=$this->gcd($b,$a%$b);
//			return $bbbb;
//		}
//	}
//}
//
//$abc=new getGcd();
//
//$bbb=$abc->gggggg(821,654);
//
//var_dump($bbb);

/*
 * 分析：当两个整数较大时，取模运算的性能会比较低
 *
 */


//----------------------------------------------------------------------------------------------------------------------

/*
 * 方法二
 *
 * 《九章算术》更相减损术
 *
 * 原理：两个正整数a和b（a>b），它们的最大公约数等于a-b的差值c和较小数b的最大公约数
 *
 * 例：10和25,25减去10的差值是15，那么10和25的最大公约数，等同于10和15的最大公约数
 *
 */
//class getGcd{
//    public function gcd($a,$b){
//        if($a==$b){
//            return $a;
//        }
//        if($a>$b){
//            return $this->gcd($a-$b,$b);
//        }else{
//            return $this->gcd($b-$a,$a);
//        }
//    }
//}
//
//$abc=new getGcd();
//$bbb=$abc->gcd(821,654);
//var_dump($bbb);

/*
 * 分析：依靠两数求差的方式来递归，运算次数远大于辗转相除法的取模方式
 */


//----------------------------------------------------------------------------------------------------------------------

/*
 * 方法三
 *
 * 辗转相除法与更相减损术结合
 *
 * 原理：把两个方法的优势结合起来，在更相减损术的基础上使用移位运算
 *
 * 说明：
 * 移位运算的性能非常快，对于给定的正整数a和b，不难得到如下的结论，其中gcb(a,b)的意思是a,b的最大公约数函数：
 * 当a和b均为偶数，gcd(a,b)=2*gcd(a/2,b/2)=2*gcd(a>>1,b>>1);
 * 当a为偶数，b为奇数，gcd(a,b)=gcd(a/2,b)=gcd(a>>1,b);
 * 当a为奇数，b为偶数，gcd(a,b)=gcd(a,b/2)=gcd(a,b>>1);
 * 当a和b均为奇数，利用更相减损术运算一次，gcd(a,b)=gcd(b,a-b),此时a-b必然是偶数，又可以进行移位运算。
 *
 */
//class getGcd{
//    public function gcd($a,$b){
//        if($a==$b){
//            return $a;
//        }
//
//        if($a<$b){
//            return $this->gcd($b,$a);
//        }else{
//            //和1做按位与运算，判断奇偶
//            if(!$a&1 && !$b&1){ //偶偶
//                return $this->gcd($a>>1,$b>>1)<<1;
//            }elseif(!$a&1 && $b&1){ //偶奇
//                return $this->gcd($a>>1,$b);
//            }elseif($a&1 && !$b&1){//奇偶
//                return $this->gcd($a,$b>>1);
//            }else{//奇奇
//                return $this->gcd($a-$b,$b);
//            }
//        }
//
//    }
//}
//
//$abc=new getGcd();
//$bbb=$abc->gcd(821,654);
//var_dump($bbb);



//echo "<img src='../images/gcd2.jpg' width='50%'>";
//echo "<img src='../images/gcd1.jpg' width='50%'>";

/*
 * 原创：伯乐在线 - 玻璃猫 链接：http://blog.jobbole.com/106315/
 */